[
      {
        "ISBN": "9781593279509",
        "Title": "Eloquent JavaScript, Third Edition",
        "Subtitle": "A Modern Introduction to Programming",
        "Author": "Marijn Haverbeke",
        "Publisher": "No Starch Press",
        "Pages": 472,
        "Value": 680,
        "Amount in Stock" : 5,
        "Description": "JavaScript lies at the heart of almost every modern web application, from social apps like Twitter to browser-based game frameworks like Phaser and Babylon. Though simple for beginners to pick up and play with, JavaScript is a flexible, complex language that you can use to build full-scale applications."
      },
      {
        "ISBN": "9781491943533",
        "Title": "Practical Modern JavaScript",
        "Subtitle": "Dive into ES6 and the Future of JavaScript",
        "Author": "Nicolás Bevacqua",
        "Publisher": "O'Reilly Media",
        "Pages": 334,
        "Value": 370,
        "Amount in Stock" : 6,
        "Description": "To get the most out of modern JavaScript, you need learn the latest features of its parent specification, ECMAScript 6 (ES6). This book provides a highly practical look at ES6, without getting lost in the specification or its implementation details."
      },
      {
        "ISBN": "9781593277574",
        "Title": "Understanding ECMAScript 6",
        "Subtitle": "The Definitive Guide for JavaScript Developers",
        "Author": "Nicholas C. Zakas",
        "Publisher": "No Starch Press",
        "Pages": 352,
        "Value": 535,
        "Amount in Stock" : 10,
        "Description": "ECMAScript 6 represents the biggest update to the core of JavaScript in the history of the language. In Understanding ECMAScript 6, expert developer Nicholas C. Zakas provides a complete guide to the object types, syntax, and other exciting changes that ECMAScript 6 brings to JavaScript."
      },
      {
        "ISBN": "9781449365035",
        "Title": "Speaking JavaScript",
        "Subtitle": "An In-Depth Guide for Programmers",
        "Author": "Axel Rauschmayer",
        "Publisher": "O'Reilly Media",
        "Pages": 460,
        "Value": 650,
        "Amount in Stock" : 0,
        "Description": "Like it or not, JavaScript is everywhere these days -from browser to server to mobile- and now you, too, need to learn the language or dive deeper than you have. This concise book guides you into and through JavaScript, written by a veteran programmer who once found himself in the same position."
      },
      {
        "ISBN": "9781449331818",
        "Title": "Learning JavaScript Design Patterns",
        "Subtitle": "A JavaScript and jQuery Developer's Guide",
        "Author": "Addy Osmani",
        "Publisher": "O'Reilly Media",
        "Pages": 254,
        "Value": 310,
        "Amount in Stock" : 11,
        "Description": "With Learning JavaScript Design Patterns, you'll learn how to write beautiful, structured, and maintainable JavaScript by applying classical and modern design patterns to the language. If you want to keep your code efficient, more manageable, and up-to-date with the latest best practices, this book is for you."
      },
      {
        "ISBN": "9798602477429",
        "Title": "You Don't Know JS Yet",
        "Subtitle": "Get Started",
        "Author": "Kyle Simpson",
        "Publisher": "Independently published",
        "Pages": 143,
        "Value": 325,
        "Amount in Stock" : 15,
        "Description": "The worldwide best selling You Don't Know JS book series is back for a 2nd edition: You Don't Know JS Yet. All 6 books are brand new, rewritten to cover all sides of JS for 2020 and beyond."
      },
      {
        "ISBN": "9781484200766",
        "Title": "Pro Git",
        "Subtitle": "Everything you neeed to know about Git",
        "Author": "Scott Chacon and Ben Straub",
        "Publisher": "Apress; 2nd edition",
        "Pages": 458,
        "Value": 710,
        "Amount in Stock" : 9,
        "Description": "Pro Git (Second Edition) is your fully-updated guide to Git and its usage in the modern world. Git has come a long way since it was first developed by Linus Torvalds for Linux kernel development. It has taken the open source world by storm since its inception in 2005, and this book teaches you how to use it like a pro."
      },
      {
        "ISBN": "9781484242216",
        "Title": "Rethinking Productivity in Software Engineering",
        "Subtitle": "",
        "Author": "Caitlin Sadowski, Thomas Zimmermann",
        "Publisher": "Apress",
        "Pages": 310,
        "Value": 430,
        "Amount in Stock" : 12,
        "Description": "Get the most out of this foundational reference and improve the productivity of your software teams. This open access book collects the wisdom of the 2017 \"Dagstuhl\" seminar on productivity in software engineering, a meeting of community leaders, who came together with the goal of rethinking traditional definitions and measures of productivity."
      }
]